{"weightsManifest": [{"weights": [{"shape": [1], "dtype": "float32", "name": "batch_normalization_1/gamma"}, {"shape": [1], "dtype": "float32", "name": "batch_normalization_1/beta"}, {"shape": [1], "dtype": "float32", "name": "batch_normalization_1/moving_mean"}, {"shape": [1], "dtype": "float32", "name": "batch_normalization_1/moving_variance"}, {"shape": [5, 5, 1, 56], "dtype": "float32", "name": "conv2d_1/kernel"}, {"shape": [56], "dtype": "float32", "name": "conv2d_1/bias"}, {"shape": [5, 5, 56, 36], "dtype": "float32", "name": "conv2d_2/kernel"}, {"shape": [36], "dtype": "float32", "name": "conv2d_2/bias"}, {"shape": [5, 5, 36, 48], "dtype": "float32", "name": "conv2d_3/kernel"}, {"shape": [48], "dtype": "float32", "name": "conv2d_3/bias"}, {"shape": [3, 3, 48, 64], "dtype": "float32", "name": "conv2d_4/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_4/bias"}, {"shape": [3, 3, 64, 64], "dtype": "float32", "name": "conv2d_5/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_5/bias"}, {"shape": [64, 500], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [500], "dtype": "float32", "name": "dense_1/bias"}, {"shape": [500, 500], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [500], "dtype": "float32", "name": "dense_2/bias"}, {"shape": [500, 18], "dtype": "float32", "name": "dense_3/kernel"}, {"shape": [18], "dtype": "float32", "name": "dense_3/bias"}], "paths": ["group1-shard1of1"]}], "modelTopology": {"keras_version": "2.2.2", "model_config": {"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_1", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"batch_input_shape": [null, 224, 224, 1], "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "dtype": "float32", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 56, "bias_constraint": null, "padding": "same"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 36, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 48, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_5", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "GlobalAveragePooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 500, "bias_regularizer": null, "name": "dense_1", "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 500, "bias_regularizer": null, "name": "dense_2", "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 18, "bias_regularizer": null, "name": "dense_3", "trainable": true, "bias_constraint": null}}]}, "training_config": {"sample_weight_mode": null, "loss": "mse", "optimizer_config": {"class_name": "RMSprop", "config": {"epsilon": 1e-07, "rho": 0.8999999761581421, "decay": 0.0, "lr": 0.0010000000474974513}}, "metrics": ["accuracy"], "loss_weights": null}, "backend": "tensorflow"}}