{"modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"batch_input_shape": [null, 224, 224, 1], "dtype": "float32", "gamma_constraint": null, "axis": -1, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_1", "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}}, "data_format": "channels_last", "trainable": true, "kernel_size": [5, 5], "dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "filters": 56, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "same", "bias_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "trainable": true, "kernel_size": [5, 5], "activation": "linear", "kernel_regularizer": null, "filters": 36, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "valid", "bias_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "trainable": true, "kernel_size": [5, 5], "activation": "linear", "kernel_regularizer": null, "filters": 48, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "valid", "bias_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "valid", "bias_regularizer": null, "name": "conv2d_4", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_4", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "valid", "bias_regularizer": null, "name": "conv2d_5", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "GlobalAveragePooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activation": "relu", "kernel_regularizer": null, "units": 500, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activation": "relu", "kernel_regularizer": null, "units": 500, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activation": "linear", "kernel_regularizer": null, "units": 18, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "name": "dense_3", "bias_constraint": null, "activity_regularizer": null}}]}, "backend": "tensorflow", "keras_version": "2.2.0", "training_config": {"loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"epsilon": 1e-07, "lr": 0.0010000000474974513, "rho": 0.8999999761581421, "decay": 0.0}}, "metrics": ["accuracy"], "sample_weight_mode": null, "loss": "mse"}}, "weightsManifest": [{"weights": [{"name": "batch_normalization_1/gamma", "dtype": "float32", "shape": [1]}, {"name": "batch_normalization_1/beta", "dtype": "float32", "shape": [1]}, {"name": "batch_normalization_1/moving_mean", "dtype": "float32", "shape": [1]}, {"name": "batch_normalization_1/moving_variance", "dtype": "float32", "shape": [1]}, {"name": "conv2d_1/kernel", "dtype": "float32", "shape": [5, 5, 1, 56]}, {"name": "conv2d_1/bias", "dtype": "float32", "shape": [56]}, {"name": "conv2d_2/kernel", "dtype": "float32", "shape": [5, 5, 56, 36]}, {"name": "conv2d_2/bias", "dtype": "float32", "shape": [36]}, {"name": "conv2d_3/kernel", "dtype": "float32", "shape": [5, 5, 36, 48]}, {"name": "conv2d_3/bias", "dtype": "float32", "shape": [48]}, {"name": "conv2d_4/kernel", "dtype": "float32", "shape": [3, 3, 48, 64]}, {"name": "conv2d_4/bias", "dtype": "float32", "shape": [64]}, {"name": "conv2d_5/kernel", "dtype": "float32", "shape": [3, 3, 64, 64]}, {"name": "conv2d_5/bias", "dtype": "float32", "shape": [64]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [64, 500]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [500]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [500, 500]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [500]}, {"name": "dense_3/kernel", "dtype": "float32", "shape": [500, 18]}, {"name": "dense_3/bias", "dtype": "float32", "shape": [18]}], "paths": ["group1-shard1of1"]}]}